## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain.mta-sts will be destroyed
  # (because azurerm_cdn_frontdoor_custom_domain.mta-sts is not in configuration)
  - resource "azurerm_cdn_frontdoor_custom_domain" "mta-sts" {
      - cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/afd-mta-sts" -> null
      - dns_zone_id              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk" -> null
      - expiration_date          = "2025-08-01T14:36:48.1243151+00:00" -> null
      - host_name                = "mta-sts.tfttest.matthewjwhite.co.uk" -> null
      - id                       = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/afd-mta-sts/customDomains/cdnmwtftestmtasts" -> null
      - name                     = "cdnmwtftestmtasts" -> null
      - validation_token         = "_fuly6u7lmhdbv9qnswpakw9hizlbwo1" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/afd-mta-sts/secrets/0--eca4c4c1-8378-4527-b594-3e86d68db1f3-mta-sts-tfttest-matthewjwhite-co-uk" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.tftest-mjw-mtasts.azurerm_dns_txt_record.dnsauth will be destroyed
  # (because azurerm_dns_txt_record.dnsauth is not in configuration)
  - resource "azurerm_dns_txt_record" "dnsauth" {
      - fqdn                = "_dnsauth.mta-sts.tfttest.matthewjwhite.co.uk." -> null
      - id                  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk/TXT/_dnsauth.mta-sts" -> null
      - name                = "_dnsauth.mta-sts" -> null
      - resource_group_name = "rg-whitefam-dnszones" -> null
      - tags                = {
          - "managed" = "as-code"
          - "source"  = "terraform"
        } -> null
      - ttl                 = 300 -> null
      - zone_name           = "tfttest.matthewjwhite.co.uk" -> null

      - record {
          - value = "_fuly6u7lmhdbv9qnswpakw9hizlbwo1" -> null
        }
    }

  # module.tftest-mjw-mtasts.azurerm_storage_account.mta-sts will be updated in-place
  ~ resource "azurerm_storage_account" "mta-sts" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftestmtasts"
        name                               = "stmwtftestmtasts"
        tags                               = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_account_static_website.mta-sts will be created
  + resource "azurerm_storage_account_static_website" "mta-sts" {
      + error_404_document = "error.htm"
      + id                 = (known after apply)
      + index_document     = "index.htm"
      + storage_account_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftestmtasts"
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.error will be created
  + resource "azurerm_storage_blob" "error" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "error.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Error Page</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.index will be created
  + resource "azurerm_storage_blob" "index" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "index.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Nothing to see</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.mta-sts will be created
  + resource "azurerm_storage_blob" "mta-sts" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = ".well-known/mta-sts.txt"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            version: STSv1
            mode: testing
            mx: tftest-mjw.mail.protection.outlook.com
            max_age: 86400
        EOT
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```
</details>